---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.ContinuousRailNotContinuous
source: html/832b5595-d8e9-605b-df67-f072667016d5.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.ContinuousRailNotContinuous Property

The rail is non-continuous.

## Syntax (C#)
```csharp
public static FailureDefinitionId ContinuousRailNotContinuous { get; }
```